2-densityFoam/testCase/shockTube/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.007;

deltaT          2.5e-6;

writeControl    timeStep;

writeInterval   200;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

maxDeltaT       1;

functions
{
    #includeFunc mag(U)
    
    //volFieldValue1
    //{
    //    type            volFieldValue;
    //    libs            ("libfieldFunctionObjects.so");
    //    writeControl    timeStep;
    //    log             yes;
    //    writeFields     no;
    //    regionType      all;
    //    name            outlet;
    //    operation       max;
    //    fields
    //    (
    //        p rho T
    //    );
    //}
}

// ************************************************************************* //
