2-densityFoam/testCase/shockTube/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,rho)   Gauss vanAlbada;
    div(phi,rhoU)  Gauss vanAlbada;
    div(phi,rhoE)  Gauss vanAlbada;
    div(phi,p)     Gauss vanAlbada;
}

laplacianSchemes
{
}

interpolationSchemes
{
    default linear
    reconstruct(var) vanLeer;
    reconstruct(rho)  vanLeer;
    reconstruct(U)  vanLeer;
    reconstruct(T) vanLeer;

    flux(rhoU)      linear;
    flux(U)         linear;
    dotInterpolate(Sf,tauMC) linear;
    interpolate(muEff) linear;
    
    interpolate(rho) linear;
    interpolate(rhoU) linear;
    interpolate(U) linear;  
    
    //interpolate(U)&Sf linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
